---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.InsulationTypeSet
source: html/9d3f1860-fc18-25bb-355e-75e1544fe693.htm
---
# InsulationTypeSet Methods

Removes every insulation type from the set, rendering it empty.